In [1]:
# Imports
import pandas as pd

In [2]:
pd.DataFrame({
    'Yes': [50, 21],
    'No': [131, 2]
})

   Yes   No
0   50  131
1   21    2

In [3]:
pd.DataFrame({
    'Bob': ['I liked it.', 'It was awful.'],
    'Sue': ['Pretty Good.', 'Bland.']
})

             Bob           Sue
0    I liked it.  Pretty Good.
1  It was awful.        Bland.

In [4]:
pd.DataFrame({
    'Bob': ['I liked it.', 'It was awful.'],
    'Sue': ['Pretty Good.', 'Bland.']
}, index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty Good.
Product B  It was awful.        Bland.

In [5]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

In [7]:
fifa_data = pd.read_csv("datasets/fifa.csv", index_col=0)
fifa_data.head()

             ARG  BRA   ESP   FRA  GER  ITA
Date
1993-08-08   5.0  8.0  13.0  12.0  1.0  2.0
1993-09-23  12.0  1.0  14.0   7.0  5.0  2.0
1993-10-22   9.0  1.0   7.0  14.0  4.0  3.0
1993-11-19   9.0  4.0   7.0  15.0  3.0  1.0
1993-12-23   8.0  3.0   5.0  15.0  1.0  2.0